{
  "add_cross_attention": false,
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "embedding_size": 768,
  "eos_token_id": null,
  "finetuning_task": "ner",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-BATTERY",
    "1": "B-CAMERA",
    "2": "B-DESIGN",
    "3": "B-FEATURES",
    "4": "B-GENERAL",
    "5": "B-PERFORMANCE",
    "6": "B-PRICE",
    "7": "B-SCREEN",
    "8": "B-SER&ACC",
    "9": "B-STORAGE",
    "10": "I-BATTERY",
    "11": "I-CAMERA",
    "12": "I-DESIGN",
    "13": "I-FEATURES",
    "14": "I-GENERAL",
    "15": "I-PERFORMANCE",
    "16": "I-PRICE",
    "17": "I-SCREEN",
    "18": "I-SER&ACC",
    "19": "I-STORAGE",
    "20": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "B-BATTERY": 0,
    "B-CAMERA": 1,
    "B-DESIGN": 2,
    "B-FEATURES": 3,
    "B-GENERAL": 4,
    "B-PERFORMANCE": 5,
    "B-PRICE": 6,
    "B-SCREEN": 7,
    "B-SER&ACC": 8,
    "B-STORAGE": 9,
    "I-BATTERY": 10,
    "I-CAMERA": 11,
    "I-DESIGN": 12,
    "I-FEATURES": 13,
    "I-GENERAL": 14,
    "I-PERFORMANCE": 15,
    "I-PRICE": 16,
    "I-SCREEN": 17,
    "I-SER&ACC": 18,
    "I-STORAGE": 19,
    "O": 20
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 62000
}
